import os

import numpy as np
from PIL import Image
from manga_ocr import MangaOcr

# The goal of this script is to generate character image files. In general, we have images full of characters, and the
# strings below tell us exactly which characters are in the image. We can use this information to generate a database
# of character images, which we can then use to detect characters in the game.

hiragana = list(
    "あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんぁぃぅぇぉっゃゅょーがぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽ")
katakana = list(
    "アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンァィゥェォッャュョ～ガギグゲゴザジズゼゾダヂヅデドバビブベボパピプペポ")
kanji = list(
    "爆炎剣魔神飛燕連脚蒼破刃烈空斬真裂虎牙牙屠龍閃断双獅子戦吼爪竜光鳳凰天駆紅蓮昇熱旋風陣王撃波翔火剛招来襲人闇闇地猛夜御衣臥月虚崩封豪疾陽雹雨秋沙抜砕絶影掌煌燐改雷刀蹴狂刹槌鐘割走衝森羅伐瞬咆迅死滅殺弓朱霧螺斜那者目覚皇翼劇舞荒業灰燼塵浄焼煉獄緋使激突廻狼山小屋秘密工場隠殿研究所海底洞窟入口出首都領灼拳逃敗北幻重覇道術技装備作星召集叩上脳世界分精統一反煙怒哮投活心燼塵浄焼煉獄緋使激突廻狼山小屋秘密工場隠殿研究所海底洞窟入口出首都領灼拳逃敗北幻重覇道術技装備作星召集叩上脳世界分精統一反煙怒哮投活心応援要請肩部再生頭化吐喚墨力足払中獲得仙庵敵弱点痛用用設定詳細補充溜多彩今携特情報続壁跳躍武器軽難易度自回復晶間合達華射漢漢立支歌白薙凍具対氷発掘食別腹負磁院政無攻震三二段返国境街村港町市暴旅行基穴兜転警丸状態異常強落石化睡衰弱印燐粉動砲大吸込進壊線乱胞両手弾千引怪槍五十亜唖娃阿哀愛挨姶逢葵茜穐悪握渥旭葦芦鯵梓圧斡扱宛姐虻飴絢綾鮎或粟袷安按暗案鞍杏以伊位依偉囲夷委威尉惟意慰椅進壊線乱胞両手弾千引怪槍五十亜唖娃阿哀愛挨姶逢葵茜穐悪握渥旭葦芦鯵梓圧斡扱宛姐虻飴絢綾鮎或粟袷安按暗案鞍杏以伊位依偉囲夷委威尉惟意慰椅為畏移維緯胃萎謂違遺医井亥域育郁磯壱溢逸稲茨芋鰯允咽咽員因姻飲淫胤蔭陰韻吋右宇烏羽迂卯鵜窺丑碓臼渦嘘唄欝蔚鰻姥厩浦瓜閏噂云云運雲荏餌叡営嬰映曳栄永泳洩瑛盈穎頴英衛詠鋭液疫益駅悦謁越閲榎厭円園堰奄宴延怨掩沿演焔猿縁艶苑薗遠鉛鴛塩於汚甥凹央奥往押旺横欧殴遠翁襖鴬鴎黄岡沖荻億憶臆桶牡乙俺卸恩温穏音下仮何伽価佳加可嘉夏嫁家寡科暇果架河珂禍禾稼箇花苛茄荷菓蝦課嘩貨迦過霞蚊俄峨我画芽蛾賀雅横欧殴翁襖鴬鴎黄岡沖荻億憶臆桶牡乙俺卸恩温穏音下仮何伽価佳加可嘉夏嫁家寡科暇果架河珂禍禾稼箇花苛茄荷菓蝦課嘩貨迦過霞蚊俄峨我画芽蛾賀雅餓駕介会解塊快悔恢懐戒拐魁晦械皆絵芥蟹開階貝凱劾外咳咳害崖慨概涯碍蓋該鎧骸浬馨蛙垣柿蛎鈎劃嚇各廓拡撹格核殻確穫角赫較郭閣隔隔革学岳楽額顎掛笠樫橿梶鰍潟喝恰括渇滑葛褐轄且鰹叶椛樺鞄株竃蒲釜鎌噛鴨栢茅萱粥刈苅瓦乾侃冠寒刊勘勧巻堪姦完官寛干幹患感慣憾換敢柑桓棺款歓汗澗潅環甘監看竿管簡緩缶翰肝艦莞観諌貫還鑑閑関陥韓館舘含岸巌玩癌眼岩翫贋雁頑顔願企伎危喜奇嬉寄岐希幾忌揮机旗既期棋棄機帰換敢柑桓棺款歓汗澗潅環甘監看竿管簡緩缶翰肝艦莞観諌貫還鑑閑関陥韓館舘含岸巌玩癌眼岩翫贋雁頑顔願企伎危喜奇嬉寄岐希幾忌揮机旗既期棋棄機帰毅気汽畿祈季稀紀徽規記貴起軌輝飢騎鬼亀偽儀妓宜戯擬欺欺犠疑祇義蟻誼議掬菊鞠吉吃喫桔橘詰砧杵黍却客虐逆丘久仇休及宮急救朽求汲汲泣灸球窮笈級糾給旧牛去居巨拒拠挙渠許距鋸漁禦魚亨享京供侠僑兇競共凶協匡卿叫喬峡彊怯恐恭挟教橋況狭矯胸脅興蕎郷鏡響饗驚仰凝尭暁局曲極玉桐粁僅勤均巾錦斤欣欽琴禁禽筋緊芹菌衿襟謹近金吟銀九倶句区狗玖矩苦躯駈駒愚虞喰偶寓遇隅串櫛釧屑屈沓靴轡窪熊隈粂栗繰桑鍬勲君薫尭暁局曲極玉桐粁僅勤均巾錦斤欣欽琴禁禽筋緊芹菌衿襟謹近金吟銀九倶句区狗玖矩苦躯駈駒愚虞喰偶寓遇隅串櫛釧屑屈沓靴轡窪熊隈粂栗繰桑鍬勲君薫訓群軍郡卦袈祁係傾刑兄啓圭珪型契形径恵慶慧憩掲携敬景桂渓畦稽系経継繋罫茎荊蛍計詣頚鶏芸迎鯨戟隙桁傑欠決潔結血訣件倹倦健兼券券喧圏堅嫌建憲懸捲検権牽犬献硯絹県見謙賢軒遣鍵険顕験鹸元原厳弦減源玄現絃舷言諺限乎個古呼固姑孤己庫弧戸故枯湖狐糊袴股胡菰誇跨鈷雇顧鼓互伍午呉吾娯後悟梧檎瑚碁語誤護醐乞鯉交佼侯候倖公功効勾厚向后喉坑垢好孔孝宏巧巷幸広庚康弘恒慌抗拘控昂晃更杭校梗構江洪浩溝甲硬跨鈷雇顧鼓互伍午呉吾娯後悟梧檎瑚碁語誤護醐乞鯉交佼侯候倖公功効勾厚向后喉坑垢好孔孝宏巧巷幸広庚康弘恒慌抗拘控昂晃更杭校梗構江洪浩溝甲硬稿糠紘絞綱耕考肯肱腔膏航衡講貢購郊酵鉱砿鋼閤降項香高高鴻劫号壕拷濠轟麹克刻告穀酷鵠黒漉腰甑忽惚骨狛此頃困坤墾婚恨懇昏昆根梱梱混痕紺艮魂些佐叉唆嵯左差査瑳砂詐鎖裟坐座挫債催最哉塞妻宰才採栽歳済災采犀砦祭斎菜裁載際剤在材罪財冴坂阪堺榊肴咲崎埼碕鷺削咋搾昨朔柵窄策索錯桜鮭笹匙冊刷察拶撮擦札薩雑皐鯖捌錆鮫皿晒傘参惨撒散桟燦珊産算纂蚕讃賛酸餐暫残仕仔伺刺司史嗣四士始姉姿屍師志思指孜斯施咋搾昨朔柵窄策索錯桜鮭笹匙冊刷察拶撮擦札薩雑皐鯖捌錆鮫皿晒傘参惨撒散桟燦珊産算纂蚕讃賛酸餐暫残仕仔伺刺司史嗣四士始姉姿屍師志思指孜斯施旨枝止氏祉私糸紙紫肢脂至視詞詩試誌諮資賜雌飼歯事似侍侍児字寺慈持時次滋治爾璽痔示而耳蒔辞汐鹿式識鴫竺軸宍雫七叱執失嫉室悉湿湿漆質実蔀篠偲柴芝屡蕊縞舎写捨赦煮社紗謝車遮蛇邪借勺尺杓爵酌釈錫若寂惹主取守殊狩珠種腫趣酒儒受呪寿授樹綬需囚収周宗就州修愁拾洲秀終繍習臭舟蒐衆讐輯週酋酬醜什住従戎柔汁渋獣縦銃叔夙宿淑祝縮粛塾熟述俊峻春竣舜駿准循旬楯殉淳準潤盾純巡遵醇順処初暑曙渚庶緒署書薯藷拾洲秀終繍習臭舟蒐衆讐輯週酋酬醜什住従戎柔汁渋獣縦銃叔夙宿淑祝縮粛塾熟述俊峻春竣舜駿准循旬楯殉淳準潤盾純巡遵醇順処初暑曙渚庶緒署書薯藷諸助叙女序徐恕鋤除傷償勝匠升哨商唱嘗奨妾娼宵将少尚庄庄床廠彰承抄捷昌昭松梢樟樵沼消渉湘焦照症省硝礁祥称章笑粧紹肖菖蒋蕉裳訟訟証詔象賞醤鉦鍾障鞘丈丞乗冗剰城壌嬢擾条杖畳穣蒸譲醸錠嘱埴飾拭植殖燭織職色触蝕辱尻伸信侵唇娠寝審慎振新晋榛浸深申疹秦紳臣芯薪親診身辛針仁壬尋甚尽腎訊靭笥諏須酢図厨逗吹垂帥推水炊粋翠遂酔錐錘随瑞髄崇嵩数枢趨雛据杉椙菅頗雀裾澄摺寸瀬畝是凄制勢姓征性成整晴棲栖正薪親診身辛針仁壬尋甚尽腎訊靭笥諏須酢図厨逗吹垂帥推水炊粋翠遂酔錐錘随瑞髄崇嵩数枢趨雛据杉椙菅頗雀裾澄摺寸瀬畝是凄制勢姓征性成整晴棲栖正清牲盛聖声製西誠誓逝醒青静斉税脆隻席惜戚斥昔析積籍績績脊責赤跡蹟碩切拙接摂折窃節説雪舌蝉先占宣専尖川扇撰栓栴泉浅洗染潜煎煽煽穿箭繊羨腺舛船薦詮賎践選遷銭銑鮮前善漸然全禅繕膳糎噌塑岨措曾曽楚狙疏疎礎祖租粗素組蘇訴阻遡鼠僧創叢倉喪壮奏爽宋層匝惣想捜掃挿掻操早曹巣槽漕燥争痩相窓糟総綜聡草荘葬藻送遭鎗霜騒像増憎臓蔵贈造促側則即息捉束測速俗属賊族卒袖其揃存孫尊損遜他太汰詑唾堕妥惰打柁舵掃挿掻操早曹巣槽漕燥争痩相窓糟総綜聡草荘葬藻送遭鎗霜騒像増憎臓蔵贈造促側則即息捉束測速俗属賊族卒袖其揃存孫尊損遜他太汰詑唾堕妥惰打柁舵楕陀駄騨体堆耐岱帯待怠戴替泰滞胎腿苔袋貸退逮隊黛鯛代代台第醍題鷹滝瀧卓啄宅托択拓沢濯琢託鐸濁諾茸凧蛸只但辰奪脱巽竪辿棚谷狸狸鱈樽誰丹単嘆坦担探旦歎淡湛炭短端箪綻耽胆蛋誕鍛団壇暖檀男談値知弛恥智池痴稚置致蜘遅馳築畜竹筑蓄逐秩窒茶嫡着仲宙忠抽昼柱注虫衷註酎鋳駐樗瀦猪苧著貯丁兆凋喋寵帖帳庁弔張彫徴懲挑暢朝潮牒眺聴脹腸蝶調諜超銚長頂鳥勅捗直朕沈珍賃鎮陳津墜椎追鎚通塚栂掴槻佃漬柘辻蔦綴虫衷註酎鋳駐樗瀦猪苧著貯丁兆凋喋寵帖帳庁弔張彫徴懲挑暢朝潮牒眺聴脹腸蝶調諜超銚長頂鳥勅捗直朕沈珍賃鎮陳津墜椎追鎚通塚栂掴槻佃漬柘辻蔦綴鍔椿潰坪壷嬬紬吊釣鶴亭低停偵剃貞呈堤帝庭廷弟悌抵挺提提梯汀碇禎程締艇訂諦蹄逓邸鄭釘鼎泥摘擢滴的笛適鏑溺哲徹撤轍迭鉄典填展店店添纏甜貼顛伝澱田電兎堵塗妬徒斗杜渡登菟賭途鍍砥砺努土奴倒党冬唐塔塘套宕島嶋悼搭東桃梼棟盗淘湯涛灯燈当痘祷等答筒糖到董蕩藤討謄豆踏透鐙陶騰闘働同堂導憧撞瞳童胴萄銅峠鴇匿徳涜督禿篤独読栃橡凸椴届鳶苫寅酉瀞噸屯惇敦沌豚遁頓呑曇鈍奈内乍凪謎灘捺鍋楢馴縄畷南楠軟汝討謄豆踏透鐙陶騰闘働同堂導憧撞瞳童胴萄銅峠鴇匿徳涜督禿篤独読栃橡凸椴届鳶苫寅酉瀞噸屯惇敦沌豚遁頓呑曇鈍奈内乍凪謎灘捺鍋楢馴縄畷南楠軟汝尼弐迩匂賑肉虹廿日乳如尿韮任妊忍認濡禰祢寧葱猫年念捻捻撚燃粘乃廼之埜嚢悩濃納能膿農覗蚤巴把播杷派琶婆罵芭馬俳廃拝排杯盃牌背背肺輩配倍培媒梅楳煤狽買売賠陪這蝿秤矧萩伯剥博拍柏泊箔粕舶薄迫曝漠縛莫駁麦函箱硲箸肇筈櫨幡肌畑畠八鉢溌醗髪罰筏閥鳩噺塙蛤隼伴判半叛帆搬斑板氾汎版犯班畔繁般藩販範釆煩頒飯挽晩番盤磐蕃蛮匪卑否妃庇彼悲扉批披斐比泌疲皮碑罷肥被誹費避非樋簸尾微枇毘琵眉美鼻柊稗匹疋伴判半叛帆搬斑板氾汎版犯班畔繁般藩販範釆煩頒飯挽晩番盤磐蕃蛮匪卑否妃庇彼悲扉批披斐比泌疲皮碑罷肥被誹費避非樋簸尾微枇毘琵眉美鼻柊稗匹疋髭彦膝菱肘弼必畢筆逼桧姫媛紐百謬俵彪標漂瓢票表評豹廟廟描病秒苗錨鋲蒜蛭鰭品彬斌浜瀕貧賓頻敏瓶不付埠夫婦富冨布府怖扶敷斧普浮浮父符腐膚芙譜賦赴阜附侮撫葡蕪楓葺蕗伏副幅服福複覆淵弗沸仏物鮒吻噴墳憤扮焚奮糞紛雰文聞丙併兵塀幣平弊柄並蔽閉陛米頁僻癖碧瞥蔑箆偏変片篇編辺遍便勉娩弁鞭保舗鋪圃捕歩甫輔穂募墓慕戊暮母簿菩倣俸包呆奉宝峰峯庖抱捧放方朋法泡烹縫芳萌蓬蜂褒訪豊邦鋒飽鵬乏亡傍剖坊妨帽蔑箆偏変片篇編辺遍便勉娩弁鞭保舗鋪圃捕歩甫輔穂募墓慕戊暮母簿菩倣俸包呆奉宝峰峯庖抱捧放方朋法泡烹縫芳萌蓬蜂褒訪豊邦鋒飽鵬乏亡傍剖坊妨帽忘忙房望某棒冒紡肪膨謀貌貿鉾防吠頬僕卜撲朴牧睦穆釦勃勃没殆堀幌奔本翻凡盆摩磨麻埋妹昧枚毎哩槙幕膜枕鮪柾鱒桝亦俣又抹末沫迄侭侭繭麿万慢満漫蔓味未魅巳箕岬蜜湊蓑稔脈妙粍民務夢牟矛鵡椋婿娘冥名命明盟迷銘鳴姪牝免棉綿緬面麺摸模茂妄孟毛盲網耗蒙儲木黙杢勿餅尤戻籾貰問悶紋門匁也冶爺耶野弥矢厄役約薬訳靖柳薮鑓愉愈油癒諭輸唯佑優勇友宥幽悠憂揖有柚湧涌猶猷由祐裕誘遊邑郵雄融夕予余与誉輿預傭幼妖餅尤戻籾貰問悶紋門匁也冶爺耶野弥矢厄役約薬訳靖柳薮鑓愉愈油癒諭輸唯佑優勇友宥幽悠憂揖有柚湧涌猶猷由祐裕誘遊邑郵雄融夕予余与誉輿預傭幼妖容庸揚揺擁曜楊様洋溶熔窯羊耀葉蓉謡踊遥養慾抑欲沃浴翌翌淀裸莱頼洛絡酪卵嵐欄濫藍蘭覧利吏履李梨理璃痢裏裡里離陸律率葎掠略劉流流琉留硫粒隆侶慮虜了亮僚凌寮料梁涼猟療瞭稜糧良諒遼量陵緑倫厘林淋琳臨輪隣鱗麟瑠塁涙累類令伶例冷励嶺怜玲礼苓鈴隷零霊麗齢暦歴列劣廉恋漣簾練聯錬呂魯櫓炉賂路露労婁廊弄朗楼榔浪漏牢篭老聾蝋郎六麓禄肋録論倭和話歪賄脇惑枠鷲亙亘鰐詫藁蕨椀湾碗腕嗅爬騙咎罠峙炸朦朧璧頷列劣廉恋漣簾練聯錬呂魯櫓炉賂路露労婁廊弄朗楼榔浪漏牢篭老聾蝋郎六麓禄肋録論倭和話歪賄脇惑枠鷲亙亘鰐詫藁蕨椀湾碗腕嗅爬騙咎罠峙炸朦朧璧頷綺咄嗟甦贄恍鑼殲裔炒渾祀穢犧祓鉤瘴謳痺袂絆憑埃鬱焉狡狡猾涎蜃緻愕傲囁磋穹咤凛籐几攫炮嶝澤臻晨萍蔡曉奚檜眞邊渕廣薔薇丼丼隕琥珀橙槐啖呵颯虔檄唸曖躊躇彗爛徘徊掟棍腑蟲奢撥鼈棹眩皹洒贅捏圓將姚姜熙栫濱睛埒踪遽潔誇尭暁局曲極玉桐粁僅勤均巾錦斤欣欽琴禁禽筋緊芹菌衿襟謹近金吟銀九倶句区狗玖矩苦躯駈駒愚虞喰偶寓遇隅串櫛釧屑屈沓靴轡窪熊隈粂栗繰桑鍬勲君薫訓群軍郡卦袈祁係傾刑兄啓圭珪型契形径恵慶慧憩掲敬景桂桂渓畦稽系経継繋罫茎荊蛍計詣頚鶏芸迎鯨戟隙桁傑欠決潔結血訣件倹倦健兼券券喧圏堅嫌建憲懸捲検権牽犬献硯絹県見謙賢軒遣鍵険顕験鹸元原厳弦減源玄現絃舷言諺限乎個古呼固姑孤己庫弧戸故枯湖狐糊袴股胡菰誇跨鈷雇顧鼓互伍午呉吾娯後悟梧檎瑚碁語誤護醐乞鯉交佼侯候倖公功効勾厚向后喉坑垢好孔孝宏巧巷幸広庚康弘恒慌抗拘控昂晃更杭校梗構江洪浩溝甲硬跨鈷雇顧鼓互伍午呉吾娯後悟梧檎瑚碁語誤護醐乞鯉交佼侯候倖公功効勾厚向后喉坑垢好孔孝宏巧巷幸広庚康弘恒慌抗拘控昂晃更杭校梗構江洪浩溝甲硬稿糠紘絞綱耕考肯肱腔膏航衡講貢購郊酵鉱砿鋼閤降項香高高鴻劫号壕拷濠轟麹克刻告穀酷鵠黒漉腰甑忽惚骨狛此頃困坤墾婚恨懇昏昆根梱梱混痕紺艮魂些佐叉唆嵯左差査瑳砂詐鎖裟坐座挫債催最哉塞妻宰才採栽歳済災采犀砦祭斎菜裁載際剤在材罪財冴坂阪堺榊肴咲崎埼碕鷺削咋搾昨朔柵窄策索錯桜鮭笹匙冊刷察拶撮擦札薩雑皐鯖捌錆鮫皿晒傘参惨撒散桟燦珊産算纂蚕讃賛酸餐暫残仕仔伺刺司史嗣四士始姉姿屍師志思指孜斯施咋搾昨朔柵窄策索錯桜鮭笹匙冊刷察拶撮擦札薩雑皐鯖捌錆鮫皿晒傘参惨撒散桟燦珊産算纂蚕讃賛酸餐暫残仕仔伺刺司史嗣四士始姉姿屍師志思指孜斯施旨枝止氏祉私糸紙紫肢脂至視詞詩試誌諮資賜雌飼歯事似侍侍児字寺慈持時次滋治爾璽痔示而耳蒔辞汐鹿式識鴫竺軸宍雫七叱執失嫉室悉湿湿漆質実蔀篠偲柴芝屡蕊縞舎写捨赦煮社紗謝車遮蛇邪借勺尺杓爵酌釈錫若寂惹主取守殊狩珠種腫趣酒儒受呪寿授樹綬需囚収周宗就州修愁拾洲秀終繍習臭舟蒐衆讐輯週酋酬醜什住従戎柔汁渋獣縦銃叔夙宿淑祝縮粛塾熟述俊峻春竣舜駿准循旬楯殉淳準潤盾純巡遵醇順処初暑曙渚庶緒署書薯藷拾洲秀終繍習臭舟蒐衆讐輯週酋酬醜什住従戎柔汁渋獣縦銃叔夙宿淑祝縮粛塾熟述俊峻春竣舜駿准循旬楯殉淳準潤盾純巡遵醇順処初暑曙渚庶緒署書薯藷諸助叙女序徐恕鋤除傷償勝匠升哨商唱嘗奨妾娼宵将少尚庄庄床廠彰承抄捷昌昭松梢樟樵沼消渉湘焦照症省硝礁祥称章笑粧紹肖菖蒋蕉裳訟訟証詔象賞醤鉦鍾障鞘丈丞乗冗剰城壌嬢擾条杖畳穣蒸譲醸錠嘱埴飾拭植殖燭織職色触蝕辱尻伸信侵唇娠寝審慎振新晋榛浸深申疹秦紳臣芯薪親診身辛針仁壬尋甚尽腎訊靭笥諏須酢図厨逗吹垂帥推水炊粋翠遂酔錐錘随瑞髄崇嵩数枢趨雛据杉椙菅頗雀裾澄摺寸瀬畝是凄制勢姓征性成整晴棲栖正薪親診身辛針仁壬尋甚尽腎訊靭笥諏須酢図厨逗吹垂帥推水炊粋翠遂酔錐錘随瑞髄崇嵩数枢趨雛据杉椙菅頗雀裾澄摺寸瀬畝是凄制勢姓征性成整晴棲栖正清牲盛聖声製西誠誓逝醒青静斉税脆隻席惜戚斥昔析積籍績績脊責赤跡蹟碩切拙接摂折窃節説雪舌蝉先占宣専尖川扇撰栓栴泉浅洗染潜煎煽煽穿箭繊羨腺舛船薦詮賎践選遷銭銑鮮前善漸然全禅繕膳糎噌塑岨措曾曽楚狙疏疎礎祖租粗素組蘇訴阻遡鼠僧創叢倉喪壮奏爽宋層匝惣想捜掃挿掻操早曹巣槽漕燥争痩相窓糟総綜聡草荘葬藻送遭鎗霜騒像増憎臓蔵贈造促側則即息捉束測速俗属賊族卒袖其揃存孫尊損遜他太汰詑唾堕妥惰打柁舵掃挿掻操早曹巣槽漕燥争痩相窓糟総綜聡草荘葬藻送遭鎗霜騒像増憎臓蔵贈造促側則即息捉束測速俗属賊族卒袖其揃存孫尊損遜他太汰詑唾堕妥惰打柁舵楕陀駄騨体堆耐岱帯待怠戴替泰滞胎腿苔袋貸退逮隊黛鯛代代台第醍題鷹滝瀧卓啄宅托択拓沢濯琢託鐸濁諾茸凧蛸只但辰奪脱巽竪辿棚谷狸狸鱈樽誰丹単嘆坦担探旦歎淡湛炭短端箪綻耽胆蛋誕鍛団壇暖檀男談値知弛恥智池痴稚置致蜘遅馳築畜竹筑蓄逐秩窒茶嫡着仲宙忠抽昼柱注虫衷註酎鋳駐樗瀦猪苧著貯丁兆凋喋寵帖帳庁弔張彫徴懲挑暢朝潮牒眺聴脹腸蝶調諜超銚長頂鳥勅捗直朕沈珍賃鎮陳津墜椎追鎚通塚栂掴槻佃漬柘辻蔦綴虫衷註酎鋳駐樗瀦猪苧著貯丁兆凋喋寵帖帳庁弔張彫徴懲挑暢朝潮牒眺聴脹腸蝶調諜超銚長頂鳥勅捗直朕沈珍賃鎮陳津墜椎追鎚通塚栂掴槻佃漬柘辻蔦綴鍔椿潰坪壷嬬紬吊釣鶴亭低停偵剃貞呈堤帝庭廷弟悌抵挺提提梯汀碇禎程締艇訂諦蹄逓邸鄭釘鼎泥摘擢滴的笛適鏑溺哲徹撤轍迭鉄典填展店店添纏甜貼顛伝澱田電兎堵塗妬徒斗杜渡登菟賭途鍍砥砺努土奴倒党冬唐塔塘套宕島嶋悼搭東桃梼棟盗淘湯涛灯燈当痘祷等答筒糖到董蕩藤討謄豆踏透鐙陶騰闘働同堂導憧撞瞳童胴萄銅峠鴇匿徳涜督禿篤独読栃橡凸椴届鳶苫寅酉瀞噸屯惇敦沌豚遁頓呑曇鈍奈内乍凪謎灘捺鍋楢馴縄畷南楠軟汝討謄豆踏透鐙陶騰闘働同堂導憧撞瞳童胴萄銅峠鴇匿徳涜督禿篤独読栃橡凸椴届鳶苫寅酉瀞噸屯惇敦沌豚遁頓呑曇鈍奈内乍凪謎灘捺鍋楢馴縄畷南楠軟汝尼弐迩匂賑肉虹廿日乳如尿韮任妊忍認濡禰祢寧葱猫年念捻捻撚燃粘乃廼之埜嚢悩濃納能膿農覗蚤巴把播杷派琶婆罵芭馬俳廃拝排杯盃牌背背肺輩配倍培媒梅楳煤狽買売賠陪這蝿秤矧萩伯剥博拍柏泊箔粕舶薄迫曝漠縛莫駁麦函箱硲箸肇筈櫨幡肌畑畠八鉢溌醗髪罰筏閥鳩噺塙蛤隼伴判半叛帆搬斑板氾汎版犯班畔繁般藩販範釆煩頒飯挽晩番盤磐蕃蛮匪卑否妃庇彼悲扉批披斐比泌疲皮碑罷肥被誹費避非樋簸尾微枇毘琵眉美鼻柊稗匹疋伴判半叛帆搬斑板氾汎版犯班畔繁般藩販範釆煩頒飯挽晩番盤磐蕃蛮匪卑否妃庇彼悲扉批披斐比泌疲皮碑罷肥被誹費避非樋簸尾微枇毘琵眉美鼻柊稗匹疋髭彦膝菱肘弼必畢筆逼桧姫媛紐百謬俵彪標漂瓢票表評豹廟廟描病秒苗錨鋲蒜蛭鰭品彬斌浜瀕貧賓頻敏瓶不付埠夫婦富冨布府怖扶敷斧普浮浮父符腐膚芙譜賦赴阜附侮撫葡蕪楓葺蕗伏副幅服福複覆淵弗沸仏物鮒吻噴墳憤扮焚奮糞紛雰文聞丙併兵塀幣平弊柄並蔽閉陛米頁僻癖碧瞥蔑箆偏変片篇編辺遍便勉娩弁鞭保舗鋪圃捕歩甫輔穂募墓慕戊暮母簿菩倣俸包呆奉宝峰峯庖抱捧放方朋法泡烹縫芳萌蓬蜂褒訪豊邦鋒飽鵬乏亡傍剖坊妨帽蔑箆偏変片篇編辺遍便勉娩弁鞭保舗鋪圃捕歩甫輔穂募墓慕戊暮母簿菩倣俸包呆奉宝峰峯庖抱捧放方朋法泡烹縫芳萌蓬蜂褒訪豊邦鋒飽鵬乏亡傍剖坊妨帽忘忙房望某棒冒紡肪膨謀貌貿鉾防吠頬僕卜撲朴牧睦穆釦勃勃没殆堀幌奔本翻凡盆摩磨麻埋妹昧枚毎哩槙幕膜枕鮪柾鱒桝亦俣又抹末沫迄侭侭繭麿万慢満漫蔓味未魅巳箕岬蜜湊蓑稔脈妙粍民務夢牟矛鵡椋婿娘冥名命明盟迷銘鳴姪牝免棉綿緬面麺摸模茂妄孟毛盲網耗蒙儲木黙杢勿餅尤戻籾貰問悶紋門匁也冶爺耶野弥矢厄役約薬訳靖柳薮鑓愉愈油癒諭輸唯佑優勇友宥幽悠憂揖有柚湧涌猶猷由祐裕誘遊邑郵雄融夕予余与誉輿預傭幼妖餅尤戻籾貰問悶紋門匁也冶爺耶野弥矢厄役約薬訳靖柳薮鑓愉愈油癒諭輸唯佑優勇友宥幽悠憂揖有柚湧涌猶猷由祐裕誘遊邑郵雄融夕予余与誉輿預傭幼妖容庸揚揺擁曜楊様洋溶熔窯羊耀葉蓉謡踊遥養慾抑欲沃浴翌翌淀裸莱頼洛絡酪卵嵐欄濫藍蘭覧利吏履李梨理璃痢裏裡里離陸律率葎掠略劉流流琉留硫粒隆侶慮虜了亮僚凌寮料梁涼猟療瞭稜糧良諒遼量陵緑倫厘林淋琳臨輪隣鱗麟瑠塁涙累類令伶例冷励嶺怜玲礼苓鈴隷零霊麗齢暦歴列劣廉恋漣簾練聯錬呂魯櫓炉賂路露労婁廊弄朗楼榔浪漏牢篭老聾蝋郎六麓禄肋録論倭和話歪賄脇惑枠鷲亙亘鰐詫藁蕨椀湾碗腕嗅爬騙咎罠峙炸朦朧璧頷列劣廉恋漣簾練聯錬呂魯櫓炉賂路露労婁廊弄朗楼榔浪漏牢篭老聾蝋郎六麓禄肋録論倭和話歪賄脇惑枠鷲亙亘鰐詫藁蕨椀湾碗腕嗅爬騙咎罠峙炸朦朧璧頷綺咄嗟甦贄恍鑼殲裔炒渾祀穢犧祓鉤瘴謳痺袂絆憑埃鬱焉狡狡猾涎蜃緻愕傲囁磋穹咤凛籐几攫炮嶝澤臻晨萍蔡曉奚檜眞邊渕廣薔薇丼丼隕琥珀橙槐啖呵颯虔檄唸曖躊躇彗爛徘徊掟棍腑蟲奢撥鼈棹眩皹洒贅捏圓將姚姜熙栫濱睛埒踪遽")
others_1 = list("、。，．．：；？！＂｀｀｀＂＾￣＿ヽヾゝゞ〃仝々〆〇－―‐／＼〜∥❘…..‘‘”（）〔〕［］｛｝〈〉《》「」『』【】＋‐±ｘ÷＝≠＜＞≦≧∞∴♂♀‘‘‘℃￥＄￠￡％＃＆＊＠§☆★○●○◇◆□")
others_2 = list("■△▲▽▼￦ￌ→←↑↓＝０１２３４５６７８９ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ")


def clean_nameselect_image(filename, contains_scrollbar=False):
    img = Image.open(filename)
    img_chars = img.crop((38, 70, 294 if contains_scrollbar else 310, 165))

    img_chars_np = np.array(img_chars.convert('RGB'))
    red, green, blue = img_chars_np.T
    white_pts = (red > 200) & (green > 200) & (blue > 200)

    img_chars_np[...] = (255, 255, 255)
    img_chars_np[...][white_pts.T] = (0, 0, 0)
    img_chars = Image.fromarray(img_chars_np)

    return img_chars


def generate_kanji_images():
    all_kanji_img = Image.open(f"data/characters/all_kanji_2.png")

    offset_x, offset_y = 0, 0
    char_size_x, char_size_y = 11, 11
    padding_x, padding_y = 1, 1

    _offset_x = offset_x
    _offset_y = offset_y
    curr_char = 0
    while curr_char < len(kanji):
        img_char = all_kanji_img.crop((_offset_x, _offset_y,
                                       _offset_x + char_size_x,
                                       _offset_y + char_size_y))

        red, green, blue = np.array(img_char.convert('RGB')).T
        white_pts = (red > 200) & (green > 200) & (blue > 200)

        if np.all(white_pts):
            continue

        img_char.save(f"data/characters/kanji/kanji_{kanji[curr_char]}.png")

        curr_char += 1
        _offset_x += char_size_x + padding_x

        if _offset_x + char_size_x + padding_x > all_kanji_img.size[0]:
            _offset_y += char_size_y + padding_y
            _offset_x = offset_x


def generate_char_images(groupname, filename, charlist,
                         offset_x=1, offset_y=1,
                         char_size_x=11, char_size_y=11,
                         padding_x=1, padding_y=3):
    os.makedirs(f"data/characters/{groupname}", exist_ok=True)
    img_chars = Image.open(filename)

    _offset_x = offset_x
    _offset_y = offset_y
    curr_char = 0
    while curr_char < len(charlist):
        img_char = img_chars.crop((_offset_x, _offset_y,
                                   _offset_x + char_size_x,
                                   _offset_y + char_size_y))

        red, green, blue = np.array(img_char.convert('RGB')).T
        white_pts = (red > 200) & (green > 200) & (blue > 200)

        _offset_x += char_size_x + padding_x

        if not np.all(white_pts):
            char = charlist[curr_char]
            img_char.save(f"data/characters/{groupname}/{groupname}_{curr_char}_{char}.png")
            curr_char += 1

        if _offset_x + char_size_x > img_chars.size[0]:
            _offset_y += char_size_y + padding_y
            _offset_x = offset_x


def load_kanji_images():
    kanji_imgs = {}
    for char in kanji:
        kanji_imgs[char] = Image.open(f"data/characters/kanji/kanji_{char}.png")

    return kanji_imgs


if __name__ == "__main__":
    generate_char_images("kanji",
                         f"../data/characters/char_tables/all_kanji_2.png",
                         kanji,
                         offset_x=0, offset_y=0,
                         padding_x=1, padding_y=1)

    # kanji_imgs = load_kanji_images()
    # filename = "hiragana"

    # img_chars = clean_nameselect_image("data/characters/others_2.png", True)
    # img_chars.save(f"data/characters/others_2_chars.png")
    #
    # generate_char_images("others_2",
    #                      f"data/characters/others_2_chars.png",
    #                      others_2,
    #                      offset_x=2, offset_y=2,
    #                      padding_x=5, padding_y=5)
